{"pageProps":{"post":{"slug":"building-flood-surveillance-system","content":"\n# Building a Real-Time Flood Surveillance System: Where GIS Meets Epidemiology\n\nDisaster response is a race against time. In regions prone to flooding, the aftermath often brings a secondary, silent killer: **Cholera**.\n\nThe link between water levels and waterborne disease is well-established, but monitoring it in real-time across vast territories like Cross River State requires more than manual reports. It requires **Automated Geospatial Intelligence**.\n\nIn this post, I'll break down how I built the **Flooding & Cholera Surveillance Dashboard**, a full-stack system that fuses epidemiological data with real-time satellite imagery to predict and visualize risk.\n\n## The Architecture\n\nThe system is built on a modern, decoupled architecture designed for scale and geospatial heavy-lifting:\n\n- **Frontend:** Next.js (React) + Leaflet for interactive mapping.\n- **Backend:** Python (FastAPI) for data processing and API.\n- **Database:** PostgreSQL + **PostGIS** for vector storage and spatial queries.\n- **Satellite Engine:** **Google Earth Engine (GEE)** for processing petabytes of Sentinel-2 (optical) and Sentinel-1 (radar) imagery.\n\n## 1. Seeing Through Clouds with Sentinel-1 SAR\n\nOne of the biggest challenges in flood monitoring is that *floods happen when it rains*, and rain means *clouds*. Traditional optical satellites (like Landsat or Sentinel-2) are blind during the storm.\n\nTo solve this, I integrated **Sentinel-1 Synthetic Aperture Radar (SAR)** data via Google Earth Engine. SAR transmits microwave signals that penetrate cloud cover, allowing us to \"see\" the ground day or night, rain or shine.\n\n### The Algorithm: Change Detection\n\nWe use a \"change detection\" approach to identify flooded areas:\n\n1.  **Baseline Image:** We fetch a composite of imagery from a dry period (pre-event).\n2.  **Event Image:** We fetch the latest radar pass during the potential flood window.\n3.  **Backscatter Analysis:** Water surfaces reflect radar signals away from the sensor (specular reflection), appearing dark. A significant drop in backscatter intensity (dB) indicates newly inundated areas.\n\nThe backend performs this analysis on-the-fly using the `earthengine-api`:\n\n```python\n# Simplified snippet from our GEE service\ndifference = after_filtered.subtract(before_filtered)\nchange_threshold = -3.0  # Decibels\nwater_mask = difference.lt(change_threshold)\n```\n\nThis generates a dynamic tile layer that overlays directly onto our Leaflet map, showing exactly where the water is *right now*.\n\n## 2. Geospatial Risk Modeling with PostGIS\n\nIdentifying water is only half the battle. We need to know **who is at risk**.\n\nWe store health facility locations and LGA (Local Government Area) boundaries in **PostGIS**, the industry-standard spatial extender for PostgreSQL.\n\nWhen a flood is detected, the backend calculates a **Risk Score** for each region based on:\n- **Flood Extent:** Percentage of land area inundated.\n- **Vulnerability:** Population density and proximity to water bodies.\n- **Epidemiological History:** Recent case rates of cholera.\n\n```sql\n-- Spatial query example\nSELECT name, ST_Area(geometry) as area\nFROM lgas\nWHERE ST_Intersects(geometry, ST_GeomFromGeoJSON(:flood_polygon));\n```\n\nThis allows us to color-code the map (Choropleth) dynamically: **Red** for high-risk zones requiring immediate intervention, **Yellow** for warning zones.\n\n## 3. The Frontend Experience\n\nData is useless if decision-makers can't understand it. The frontend is built with **Next.js** for performance and SEO.\n\n- **Interactive Map:** Users can drill down from the state level to specific LGAs.\n- **Time-Lapse Mode:** A slider allows replaying historical data to see how outbreaks correlate with past flood events.\n- **Dual-Axis Charts:** We visualize the correlation between rainfall (bars) and case rates (lines) to reveal lag effects—cases often spike *after* the rain stops and stagnant water remains.\n\n## Conclusion\n\nThis project demonstrates the power of combining **Remote Sensing** with **Modern Web Engineering**. By automating the ingestion of satellite data, we move from reactive \"cleanup\" to proactive \"early warning.\"\n\nThe stack—**Python, PostGIS, and Google Earth Engine**—proved to be a robust foundation for building scalable, life-saving geospatial tools.\n\n---\n\n*Check out the code on [GitHub](https://github.com/Some19ice/flooding-cholera) or view the [Live Dashboard](https://flooding-cholera.vercel.app).*\n","readTime":"12 min read","title":"Building a Real-Time Flood Surveillance System with Satellite Imagery & PostGIS","date":"2026-01-26","excerpt":"How we built a comprehensive disaster response dashboard integrating Google Earth Engine, Sentinel-1 SAR imagery, and epidemiological data to predict cholera outbreaks.","coverImage":"/flood-cholera-dashboard.svg","tags":["GIS","Full Stack","Google Earth Engine","Python","React","PostGIS"]}},"__N_SSG":true}